In [1]:
# SQL ALchemy 
from sqlalchemy import create_engine

# Import PyMySQL
import pymysql
pymysql.install_as_MySQLdb()

# Config Variables 
from config import remote_db_endpoint, remote_db_port
from config import remote_gwsis_dbname, remote_gwsis_dbuser, remote_gwsis_dbpwd
from config import local_db_user, local_db_pwd, local_db_endpoint, local_db_port, local_db_name

# Import Pandas 
import pandas as pd

In [2]:
# Create engine and pass mySQL connnection 

# CSV Files
income_csv = "Resources/Annual_Avg_Pay.csv"
income_df = pd.read_csv(income_csv)

unemployment_csv = "Resources/unemployment_rate.csv"
unemployment_df = pd.read_csv(unemployment_csv)

education_csv = "Resources/education_cleaner.csv"
education_df = pd.read_csv(education_csv)

hiv_rates_csv = "Resources/New_HIV_Case_Rates.csv"
hiv_rates_df = pd.read_csv(hiv_rates_csv)

hiv_cases_csv = "Resources/USHIVCases_clean.csv"
hiv_cases_df = pd.read_csv(hiv_cases_csv)

# Cloud MySQl database connection on AWS
engine = create_engine(f"mysql://{remote_gwsis_dbuser}:{remote_gwsis_dbpwd}@{remote_db_endpoint}:{remote_db_port}/{remote_gwsis_dbname}")

In [3]:
# Create remote database engine connection 
conn = engine.connect()

In [4]:
# Dataframe to SQL
income_df.to_sql(name='income_data', if_exists='append', con=conn, chunksize=500, index=False)

unemployment_df.to_sql(name='unemployment_data', if_exists='append', con=conn, chunksize=500, index=False)

education_df.to_sql(name='education_data', if_exists='append', con=conn, chunksize=500, index=False)

hiv_rates_df.to_sql(name='hiv_rates_data', if_exists='append', con=conn, chunksize=500, index=False)

hiv_cases_df.to_sql(name='hiv_cases_data', if_exists='append', con=conn, chunksize=500, index=False)

In [5]:
remote_income_data = pd.read_sql("SELECT * FROM income_data", conn)
print(len(remote_income_data))
remote_income_data.head()

51

,Name,Annual_Avg_Pay_2008-2012,Annual_Avg_Pay_2013-2018,Annual_Avg_Pay_Variance,New HIV Case Rate 2008-2012,New HIV Case Rate 2013-2018,New HIV Case Rate Variance
0,Alabama,40324.2,44679.833333,4355.633333,14.385351,13.219613,1.165738
1,Alaska,48227.0,53787.666667,5560.666667,4.147444,3.996431,0.151014
2,Arizona,43764.6,48551.166667,4786.566667,9.750057,10.556607,-0.806551
3,Arkansas,36474.2,41381.833333,4907.633333,8.503143,9.644722,-1.141579
4,California,53627.0,62525.000000,8898.000000,14.223003,12.548216,1.674786

In [6]:
remote_unemployment_data = pd.read_sql("SELECT * FROM unemployment_data", conn)
print(len(remote_unemployment_data))
remote_unemployment_data.head()

51

,Name,Unemployment_rate_2008-2012,Unemployment_rate_2013-2018,Unemployment_rate_variance,New HIV Case Rate 2008-2012,New HIV Case Rate 2013-2018,New HIV Case Rate Variance
0,Alabama,8.96,5.700000,3.260000,14.385351,13.219613,1.165738
1,Alaska,7.40,6.816667,0.583333,4.147444,3.996431,0.151014
2,Arizona,8.86,5.950000,2.910000,9.750057,10.556607,-0.806551
3,Arkansas,7.48,4.933333,2.546667,8.503143,9.644722,-1.141579
4,California,10.56,6.183333,4.376667,14.223003,12.548216,1.674786

In [7]:
remote_education_data = pd.read_sql("SELECT * FROM education_data", conn)
print(len(remote_education_data))
remote_education_data.head()

51

            Name  Graduates 2008-2012  Graduates 2013-2018  Graduates Variance
0       Alabama               43604.6              45118.6              1514.0
1        Alaska                8032.2               7812.0              -220.2
2       Arizona               62573.2              66317.6              3744.4
3      Arkansas               28336.4              30091.6              1755.2
4    California              396197.8             423133.0             26935.2

In [8]:
remote_hiv_rates_data = pd.read_sql("SELECT * FROM hiv_rates_data", conn)
print(len(remote_hiv_rates_data))
remote_hiv_rates_data.head()

51

,Name,New HIV Case Rate 2008-2012,New HIV Case Rate 2013-2018,New HIV Case Rate Variance
0,Alabama,14.385351,13.219613,1.165738
1,Alaska,4.147444,3.996431,0.151014
2,Arizona,9.750057,10.556607,-0.806551
3,Arkansas,8.503143,9.644722,-1.141579
4,California,14.223003,12.548216,1.674786

In [9]:
remote_hiv_cases_data = pd.read_sql("SELECT * FROM hiv_cases_data", conn)
print(len(remote_hiv_cases_data))
remote_hiv_cases_data.head()

1

,Name,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018
0,US,47290,44751,43067,41311,40529,39230,39963,39796,39520,38226,37286